![](pic/mysql2.jpg)

## 복습: SELECT 문

<br><br>
<span style="color:blue; font-size: 1.2em;" >
SELECT&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;column, group_function(column)   
FROM&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;table  
[WHERE &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;condition]  
[GROUP BY&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;column]    
[HAVING &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;group_condition]  
[ORDER BY&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;column] ; </span>

<br><br><br><br><br><br>
**<span style="color:red">
다음 셀은 mysql DB와 편집기를 연결하는 명령입니다.  
수업을 시작할 때 마다 가장 먼저 실행하여야 합니다.**

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%sql mysql://root:hannam@localhost/galaxy

C:\Users\PC-15\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xB4\\xEB\\xC7\\xD1\\xB9\\xCE...' for column 'VARIABLE_VALUE' at row 518")
  result = self._query(query)
C:\Users\PC-15\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

'Connected: root@galaxy'

# 6장 &nbsp;&nbsp;   서브쿼리(Subquery)
<br><br><br><br>

Abel 보다 월급을 많이 받는 사원은 누구?  
![](pic/pic6_1.jpg)

<br><br>

* 이 문제를 해결하려면 두 개의 SQL 문이 필요하다.
* Abel의 월급을 알아내는 첫번째 Query 
* 첫번째 Query의 결과로 얻어진 월급보다 많이 받는 종업원을 찾는 두번째 Query 
* 두개의 Query를 결합하여, 먼저 실행되어야 하는 query를 나중에 실행되어야 하는 query의 내부에 포함시킨다. 
* 내부 Query를 Subquery라 하고, 외부 Query를 Main Query라 부른다.
* Subquery는 Main Query가 실행 되기전에 한 번 실행된다.
* Subquery의 결과는 Main Query에 사용된다.

### 문법


<span style="color:blue; font-size: 1.2em;" >
SELECT&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;select_list    
FROM&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;table    
WHERE&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;expr&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;operator  
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;(&nbsp;&nbsp;SELECT	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;select_list    
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;FROM	&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;table&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;)

In [2]:
%%sql
SELECT last_name, salary
FROM   employees
WHERE  salary >
               (SELECT salary
                FROM   employees
                WHERE  last_name = 'Abel');

 * mysql://root:***@localhost/galaxy
5 rows affected.

[('King', Decimal('24000.00')),
 ('Kochhar', Decimal('17000.00')),
 ('De Haan', Decimal('17000.00')),
 ('Hartstein', Decimal('13000.00')),
 ('Higgins', Decimal('12000.00'))]


### subquery를 단독으로 실행해 보자. 결과는?

In [ ]:
%%sql
SELECT salary
FROM   employees
WHERE  last_name = 'Abel';


### subquery의 결과인 11000을 대입하여 Main Query를 실행해 보자. 동일한 결과를 얻는가?

In [ ]:
%%sql
SELECT last_name, salary
FROM   employees
WHERE  salary > 11000;

<br><br>
## 서브쿼리 사용 가이드라인
<br>
* 서브쿼리를 괄호로 묶는다.
* 비교 조건의 오른쪽에 서브쿼리를 놓는다.
* 단일 행 서브쿼리에는 단일행 연산자를 사용하고, 다중 행 서브쿼리에는 다중행 연산자를 사용한다.

## 서브쿼리의 유형


![](pic/pic6_2.jpg)

## 단일 행 서브쿼리


* 한 행만 반환한다.
* 단일 행 비교 연산자를 사용한다.
![](pic/pic6_3.jpg)

In [4]:
%%sql
SELECT last_name, job_id, salary
FROM   employees
WHERE  job_id =  
                (SELECT job_id
                 FROM   employees
                 WHERE  employee_id = 141)
AND    salary >
                (SELECT salary
                 FROM   employees
                 WHERE  employee_id = 143);

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('Rajs', 'ST_CLERK', Decimal('3500.00')),
 ('Davies', 'ST_CLERK', Decimal('3100.00'))]

In [5]:
%%sql
SELECT job_id
FROM   employees
WHERE  employee_id = 141

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('ST_CLERK',)]

In [6]:
%%sql
SELECT salary
FROM   employees
WHERE  employee_id = 143;

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(Decimal('2600.00'),)]

In [7]:
%%sql
SELECT last_name, job_id, salary
FROM   employees
WHERE  job_id = "ST_CLERK"
AND    salary > 2600;

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('Rajs', 'ST_CLERK', Decimal('3500.00')),
 ('Davies', 'ST_CLERK', Decimal('3100.00'))]

<br><br>
### Group 함수를 이용한 서브쿼리
<br>

In [3]:
%%sql
SELECT last_name, job_id, salary
FROM   employees
WHERE  salary = 
                (SELECT MIN(salary)
                 FROM   employees);

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('Vargas', 'ST_CLERK', Decimal('2500.00'))]

<br><br>
### Having 절에서의 Subquery 사용
<br>

In [8]:
%%sql
SELECT   department_id, MIN(salary)
FROM     employees
GROUP BY department_id
HAVING   MIN(salary) >
                       (SELECT MIN(salary)
                        FROM   employees
                        WHERE  department_id = 50);

 * mysql://root:***@localhost/galaxy
7 rows affected.

[(None, Decimal('7000.00')),
 (10, Decimal('4400.00')),
 (20, Decimal('6000.00')),
 (60, Decimal('4200.00')),
 (80, Decimal('8600.00')),
 (90, Decimal('17000.00')),
 (110, Decimal('8300.00'))]

<br><br>
### 다음은 무엇이 잘못 되었나?
<br>

In [11]:
%%sql
SELECT employee_id, last_name
FROM   employees
group by department_id
havig  salary =
                (SELECT   MIN(salary)
                 FROM     employees
                 GROUP BY department_id);

 * mysql://root:***@localhost/galaxy
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'havig  salary =\n                (SELECT   MIN(salary)\n                 FROM     ' at line 4") [SQL: 'SELECT employee_id, last_name\nFROM   employees\ngroup by department_id\nhavig  salary =\n                (SELECT   MIN(salary)\n                 FROM     employees\n                 GROUP BY department_id);'] (Background on this error at: http://sqlalche.me/e/f405)


### 다중 행 서브쿼리와 단일행 비교연산자가 사용되었다!!!
<br><br><br><br>
### 다음 SQL문의 결과는?
<br>

In [15]:
%%sql
SELECT last_name, job_id
FROM   employees
WHERE  job_id =
                (SELECT job_id
                 FROM   employees
                 WHERE  last_name = 'King');

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('King', 'AD_PRES')]

In [14]:
%%sql
SELECT job_id
FROM   employees
WHERE  last_name = 'King';

 * mysql://root:***@localhost/galaxy
1 rows affected.

[('AD_PRES',)]

## 다중 행 서브쿼리


* 여러 행을 반환한다.
* 다중 행 비교 연산자를 사용한다.
![](pic/pic6_4.jpg)

### ANY

In [16]:
%%sql
SELECT employee_id, last_name, job_id, salary
FROM   employees
WHERE  salary < ANY
                    (SELECT salary
                     FROM   employees
                     WHERE  job_id = 'IT_PROG')
AND    job_id <> 'IT_PROG';
#9000보다 작으면서 it_prog가 아닌!

 * mysql://root:***@localhost/galaxy
10 rows affected.

[(124, 'Mourgos', 'ST_MAN', Decimal('5800.00')),
 (141, 'Rajs', 'ST_CLERK', Decimal('3500.00')),
 (142, 'Davies', 'ST_CLERK', Decimal('3100.00')),
 (143, 'Matos', 'ST_CLERK', Decimal('2600.00')),
 (144, 'Vargas', 'ST_CLERK', Decimal('2500.00')),
 (176, 'Taylor', 'SA_REP', Decimal('8600.00')),
 (178, 'Grant', 'SA_REP', Decimal('7000.00')),
 (200, 'Whalen', 'AD_ASST', Decimal('4400.00')),
 (202, 'Fay', 'MK_REP', Decimal('6000.00')),
 (206, 'Gietz', 'AC_ACCOUNT', Decimal('8300.00'))]

In [17]:
%%sql
SELECT salary
FROM   employees
WHERE  job_id = 'IT_PROG';

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(Decimal('9000.00'),), (Decimal('6000.00'),), (Decimal('4200.00'),)]

### ALL

In [18]:
%%sql
SELECT employee_id, last_name, job_id, salary
FROM   employees
WHERE  salary < ALL
                    (SELECT salary
                     FROM   employees
                     WHERE  job_id = 'IT_PROG')
AND    job_id <> 'IT_PROG';

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(141, 'Rajs', 'ST_CLERK', Decimal('3500.00')),
 (142, 'Davies', 'ST_CLERK', Decimal('3100.00')),
 (143, 'Matos', 'ST_CLERK', Decimal('2600.00')),
 (144, 'Vargas', 'ST_CLERK', Decimal('2500.00'))]

## <span style="color:red">** 연습문제 **</span>

In [19]:
%%sql
select * from employees;

 * mysql://root:***@localhost/galaxy
20 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', Decimal('24000.00'), None, None, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1989, 9, 21), 'AD_VP', Decimal('17000.00'), None, 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1993, 1, 13), 'AD_VP', Decimal('17000.00'), None, 100, 90),
 (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', datetime.date(1990, 1, 3), 'IT_PROG', Decimal('9000.00'), None, 102, 60),
 (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', datetime.date(1991, 5, 21), 'IT_PROG', Decimal('6000.00'), None, 103, 60),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.date(1999, 2, 7), 'IT_PROG', Decimal('4200.00'), None, 103, 60),
 (124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', datetime.date(1999, 11, 16), 'ST_MAN', Decimal('5800.00'), None, 100, 50),
 (141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', datetime.date(1995, 10, 17), 'ST_CLERK', Decimal('3500.00'), None, 124, 50),
 (142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', datetime.date(1997, 1, 29), 'ST_CLERK', Decimal('3100.00'), None, 124, 50),
 (143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', datetime.date(1998, 3, 15), 'ST_CLERK', Decimal('2600.00'), None, 124, 50),
 (144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', datetime.date(1998, 7, 9), 'ST_CLERK', Decimal('2500.00'), None, 124, 50),
 (149, 'Eleni', 'Zlotkey', 'EZLOTKEY', '011.44.1344.429018', datetime.date(2000, 1, 29), 'SA_MAN', Decimal('10500.00'), Decimal('0.20'), 100, 80),
 (174, 'Ellen', 'Abel', 'EABEL', '011.44.1644.429267', datetime.date(1996, 5, 11), 'SA_REP', Decimal('11000.00'), Decimal('0.30'), 149, 80),
 (176, 'Jonathon', 'Taylor', 'JTAYLOR', '011.44.1644.429265', datetime.date(1998, 3, 24), 'SA_REP', Decimal('8600.00'), Decimal('0.20'), 149, 80),
 (178, 'Kimberely', 'Grant', 'KGRANT', '011.44.1644.429263', datetime.date(1999, 5, 24), 'SA_REP', Decimal('7000.00'), Decimal('0.15'), 149, None),
 (200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444', datetime.date(1987, 9, 17), 'AD_ASST', Decimal('4400.00'), None, 101, 10),
 (201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555', datetime.date(1996, 2, 17), 'MK_MAN', Decimal('13000.00'), None, 100, 20),
 (202, 'Pat', 'Fay', 'PFAY', '603.123.6666', datetime.date(1997, 8, 17), 'MK_REP', Decimal('6000.00'), None, 201, 20),
 (205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', datetime.date(1994, 6, 7), 'AC_MGR', Decimal('12000.00'), None, 101, 110),
 (206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', datetime.date(1994, 6, 7), 'AC_ACCOUNT', Decimal('8300.00'), None, 205, 110)]

In [39]:
%%sql
select * from departments;

 * mysql://root:***@localhost/galaxy
8 rows affected.

[(10, 'Administration', 200, 1700),
 (20, 'Marketing', 201, 1800),
 (50, 'Shipping', 124, 1500),
 (60, 'IT', 103, 1400),
 (80, 'Sales', 149, 2500),
 (90, 'Executive', 100, 1700),
 (110, 'Accounting', 205, 1700),
 (190, 'Contracting', None, 1700)]

In [52]:
%%sql
select * from locations

 * mysql://root:***@localhost/galaxy
5 rows affected.

[(1400, '2014 Jabberwocky Rd', '26192', 'Southlake', 'Texas', 'US'),
 (1500, '2011 Interiors Blvd', '99236', 'South San Francisco', 'California', 'US'),
 (1700, '2004 Charade Rd', '98199', 'Seattle', 'Washington', 'US'),
 (1800, '460 Bloor St. W.', 'ON M5S 1X8', 'Toronto', 'Ontario', 'CA'),
 (2500, 'Magdalen Centre, The Oxford Science Park', 'OX9 9ZB', 'Oxford', 'Oxford', 'UK')]

<br><br>
<span style="color:red">[문제 1]</span>   
Zlotkey와 동일한 부서에 속한 모든 사원의 이름과 입사일을 표시하라.   
단, Zlotkey는 제외하라.

<span style="color:orange">
결과는 2줄

In [22]:
%%sql
select last_name, hire_date
from employees
where department_id = (select department_id from employees where last_name = 'Zlotkey') AND last_name <> 'Zlotkey'

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('Abel', datetime.date(1996, 5, 11)), ('Taylor', datetime.date(1998, 3, 24))]

<br><br>
<span style="color:red">[문제 2]</span>   
급여가 평균 급여보다 많은 모든 사원의 사원번호와 이름을 나타내라.   
급여에 대한 오름 차순으로 정렬하라.

In [29]:
%%sql
select employee_id, last_name, salary
from employees
where salary > (select avg(salary) from employees)
order by salary asc

 * mysql://root:***@localhost/galaxy
8 rows affected.

[(103, 'Hunold', Decimal('9000.00')),
 (149, 'Zlotkey', Decimal('10500.00')),
 (174, 'Abel', Decimal('11000.00')),
 (205, 'Higgins', Decimal('12000.00')),
 (201, 'Hartstein', Decimal('13000.00')),
 (101, 'Kochhar', Decimal('17000.00')),
 (102, 'De Haan', Decimal('17000.00')),
 (100, 'King', Decimal('24000.00'))]

<br><br>
<span style="color:red">[문제 3]</span>   
이름에 u 가 포함된 사원과같은 부서에서 일하는 모든 사원의사원번호와 이름을 표시하라.

<span style="color:orange">
결과는 8줄

In [37]:
%%sql
select employee_id, last_name
from employees
where department_id = any(select department_id from employees where last_name like '%u%')

 * mysql://root:***@localhost/galaxy
8 rows affected.

[(103, 'Hunold'),
 (104, 'Ernst'),
 (107, 'Lorentz'),
 (124, 'Mourgos'),
 (141, 'Rajs'),
 (142, 'Davies'),
 (143, 'Matos'),
 (144, 'Vargas')]

In [32]:
%%sql
select department_id, last_name from employees where last_name like '%u%'

 * mysql://root:***@localhost/galaxy
2 rows affected.

[(60, 'Hunold'), (50, 'Mourgos')]

<br><br>
<span style="color:red">[문제 4]</span>   
부서 위치 ID가 1700 인 모든 사원의 이름, 부서번호, 업무 ID 를 나타내라.

<span style="color:orange">
결과는 6줄

In [48]:
%%sql
select last_name, department_id, job_id
from employees
where department_id = any(select department_id from departments where location_id=1700)

 * mysql://root:***@localhost/galaxy
6 rows affected.

[('Whalen', 10, 'AD_ASST'),
 ('King', 90, 'AD_PRES'),
 ('Kochhar', 90, 'AD_VP'),
 ('De Haan', 90, 'AD_VP'),
 ('Higgins', 110, 'AC_MGR'),
 ('Gietz', 110, 'AC_ACCOUNT')]

In [45]:
%%sql
select department_id from departments where location_id=1700

 * mysql://root:***@localhost/galaxy
4 rows affected.

[(10,), (90,), (110,), (190,)]

<br><br>
<span style="color:red">[문제 5]</span>   
Toronto에서 근무하는 모든 사원의 이름, 업무, 부서번호, 부서이름을 표시하라.   

<span style="color:orange">
결과는 2줄

In [65]:
%%sql
select last_name, job_id, e.department_id, department_name
from employees e, departments d
where e.department_id = d.department_id and d.department_id = (select department_id from departments NATURAL JOIN locations where city = 'Toronto')

 * mysql://root:***@localhost/galaxy
2 rows affected.

[('Hartstein', 'MK_MAN', 20, 'Marketing'), ('Fay', 'MK_REP', 20, 'Marketing')]